#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
tf/env/production relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/tcry.pt/tcry.pt/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/tcry.pt/tcry.pt

To view this run in a browser, visit:
https://app.terraform.io/app/tcrypt/production-tcrypt/runs/run-jeX78H2LWaivoPVo

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.tcrypt.digitalocean_floating_ip.beacon_1: Refreshing state... [id=159.89.220.161]
module.tcrypt.digitalocean_vpc.region_1: Refreshing state... [id=2b0aaf42-a9b4-4226-aeb3-32acc2973103]
module.tcrypt.digitalocean_record.beacon: Refreshing state... [id=120617217]
module.tcrypt.digitalocean_droplet.compute_beacon_1: Refreshing state... [id=215984614]
module.tcrypt.data.template_file.cloud_init: Refreshing state... [id=ac349f70e64bbf13295cdca67ce58faf95f55fb5d6ccc59f59dc0167e86a02d1]
module.tcrypt.digitalocean_droplet.compute_worker_1: Refreshing state... [id=215984674]
module.tcrypt.digitalocean_volume.storage_1: Refreshing state... [id=ebf89721-1338-11eb-9461-0a58ac1420e9]
module.tcrypt.digitalocean_floating_ip.proxy_1: Refreshing state... [id=167.172.9.215]
module.tcrypt.digitalocean_domain.root: Refreshing state... [id=tcry.pt]
module.tcrypt.digitalocean_record.mail_verification["2"]: Refreshing state... [id=120617226]
module.tcrypt.digitalocean_record.mail_mx["1"]: Refreshing state... [id=120617218]
module.tcrypt.digitalocean_record.code: Refreshing state... [id=120617221]
module.tcrypt.digitalocean_record.mail_verification["1"]: Refreshing state... [id=120617220]
module.tcrypt.digitalocean_record.mail_cname["1"]: Refreshing state... [id=120617223]
module.tcrypt.digitalocean_record.mail_mx["0"]: Refreshing state... [id=120617224]
module.tcrypt.digitalocean_record.mail_verification["0"]: Refreshing state... [id=120617225]
module.tcrypt.digitalocean_record.mail_cname["2"]: Refreshing state... [id=120617222]
module.tcrypt.digitalocean_record.mail_cname["0"]: Refreshing state... [id=120617219]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.tcrypt.digitalocean_droplet.compute_beacon_1 will be destroyed
  - resource "digitalocean_droplet" "compute_beacon_1" {
      - backups              = false -> null
      - created_at           = "2020-11-08T23:10:25Z" -> null
      - disk                 = 25 -> null
      - id                   = "215984614" -> null
      - image                = "ubuntu-20-04-x64" -> null
      - ipv4_address         = "167.172.118.77" -> null
      - ipv4_address_private = "10.2.0.4" -> null
      - ipv6                 = true -> null
      - ipv6_address         = "2604:a880:2:d1::e2:5001" -> null
      - locked               = false -> null
      - memory               = 1024 -> null
      - monitoring           = true -> null
      - name                 = "compute-beacon-1" -> null
      - price_hourly         = 0.00744 -> null
      - price_monthly        = 5 -> null
      - private_networking   = true -> null
      - region               = "sfo2" -> null
      - resize_disk          = true -> null
      - size                 = "s-1vcpu-1gb" -> null
      - status               = "active" -> null
      - tags                 = [] -> null
      - urn                  = "do:droplet:215984614" -> null
      - user_data            = "37768d65eb22df27b5670658ef39d4c2160a2ff6" -> null
      - vcpus                = 1 -> null
      - volume_ids           = [] -> null
      - vpc_uuid             = "2b0aaf42-a9b4-4226-aeb3-32acc2973103" -> null
    }

  # module.tcrypt.digitalocean_droplet.compute_worker_1 will be destroyed
  - resource "digitalocean_droplet" "compute_worker_1" {
      - backups              = false -> null
      - created_at           = "2020-11-08T23:10:37Z" -> null
      - disk                 = 25 -> null
      - id                   = "215984674" -> null
      - image                = "ubuntu-20-04-x64" -> null
      - ipv4_address         = "64.225.44.93" -> null
      - ipv4_address_private = "10.2.0.2" -> null
      - ipv6                 = true -> null
      - ipv6_address         = "2604:a880:2:d1::13e:7001" -> null
      - locked               = false -> null
      - memory               = 1024 -> null
      - monitoring           = true -> null
      - name                 = "compute-worker-1" -> null
      - price_hourly         = 0.00744 -> null
      - price_monthly        = 5 -> null
      - private_networking   = true -> null
      - region               = "sfo2" -> null
      - resize_disk          = true -> null
      - size                 = "s-1vcpu-1gb" -> null
      - status               = "active" -> null
      - tags                 = [] -> null
      - urn                  = "do:droplet:215984674" -> null
      - user_data            = "37768d65eb22df27b5670658ef39d4c2160a2ff6" -> null
      - vcpus                = 1 -> null
      - volume_ids           = [
          - "ebf89721-1338-11eb-9461-0a58ac1420e9",
        ] -> null
      - vpc_uuid             = "2b0aaf42-a9b4-4226-aeb3-32acc2973103" -> null
    }

  # module.tcrypt.digitalocean_droplet.compute_workers_region_1[0] will be created
  + resource "digitalocean_droplet" "compute_workers_region_1" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + id                   = (known after apply)
      + image                = "ubuntu-20-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = true
      + ipv6_address         = (known after apply)
      + ipv6_address_private = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = "compute-worker-sfo2-0"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = true
      + region               = "sfo2"
      + resize_disk          = true
      + size                 = "s-1vcpu-1gb"
      + status               = (known after apply)
      + urn                  = (known after apply)
      + user_data            = "9ecb6538e62b29cae58bc8869e0b8b1a21d06b9f"
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = "2b0aaf42-a9b4-4226-aeb3-32acc2973103"
    }

  # module.tcrypt.digitalocean_droplet.compute_workers_region_1[1] will be created
  + resource "digitalocean_droplet" "compute_workers_region_1" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + id                   = (known after apply)
      + image                = "ubuntu-20-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = true
      + ipv6_address         = (known after apply)
      + ipv6_address_private = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = "compute-worker-sfo2-1"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = true
      + region               = "sfo2"
      + resize_disk          = true
      + size                 = "s-1vcpu-1gb"
      + status               = (known after apply)
      + urn                  = (known after apply)
      + user_data            = "9ecb6538e62b29cae58bc8869e0b8b1a21d06b9f"
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = "2b0aaf42-a9b4-4226-aeb3-32acc2973103"
    }

  # module.tcrypt.digitalocean_droplet.compute_workers_region_2[0] will be created
  + resource "digitalocean_droplet" "compute_workers_region_2" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + id                   = (known after apply)
      + image                = "ubuntu-20-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = true
      + ipv6_address         = (known after apply)
      + ipv6_address_private = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = "compute-workerr-sfo2-0"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = true
      + region               = "sgp1"
      + resize_disk          = true
      + size                 = "s-1vcpu-1gb"
      + status               = (known after apply)
      + urn                  = (known after apply)
      + user_data            = "9ecb6538e62b29cae58bc8869e0b8b1a21d06b9f"
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # module.tcrypt.digitalocean_floating_ip.beacon_1 will be destroyed
  - resource "digitalocean_floating_ip" "beacon_1" {
      - droplet_id = 215984614 -> null
      - id         = "159.89.220.161" -> null
      - ip_address = "159.89.220.161" -> null
      - region     = "sfo2" -> null
      - urn        = "do:floatingip:159.89.220.161" -> null
    }

  # module.tcrypt.digitalocean_floating_ip.proxy_1 will be updated in-place
  ~ resource "digitalocean_floating_ip" "proxy_1" {
      ~ droplet_id = 215984674 -> (known after apply)
        id         = "167.172.9.215"
        ip_address = "167.172.9.215"
        region     = "sfo2"
        urn        = "do:floatingip:167.172.9.215"
    }

  # module.tcrypt.digitalocean_record.beacon will be destroyed
  - resource "digitalocean_record" "beacon" {
      - domain   = "tcry.pt" -> null
      - flags    = 0 -> null
      - fqdn     = "beacon.tcry.pt" -> null
      - id       = "120617217" -> null
      - name     = "beacon" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "A" -> null
      - value    = "159.89.220.161" -> null
      - weight   = 0 -> null
    }

  # module.tcrypt.digitalocean_vpc.region_2 will be created
  + resource "digitalocean_vpc" "region_2" {
      + created_at = (known after apply)
      + default    = (known after apply)
      + id         = (known after apply)
      + ip_range   = "10.2.0.0/20"
      + name       = "tcrypt-production-sgp1"
      + region     = "sgp1"
      + urn        = (known after apply)
    }

Plan: 4 to add, 1 to change, 4 to destroy.
```

</details>

*Pusher: @tyler-smith, Action: `pull_request`*